class PHQ9ResultChecker {
  String phq1;
  String phq2;
  String phq3;
  String phq4;
  String phq5;
  String phq6;
  String phq7;
  String phq8;
  String phq9;

  PHQ9ResultChecker({
    required this.phq1,
    required this.phq2,
    required this.phq3,
    required this.phq4,
    required this.phq5,
    required this.phq6,
    required this.phq7,
    required this.phq8,
    required this.phq9,
  });

// class name extends StatefulWidget {
//   const name({super.key});

//   @override
//   State<name> createState() => _nameState();
// }

// class _nameState extends State<name> {
//   @override
//   Widget build(BuildContext context) {
//     return Container(
//         child: Column(
//       children: [
//         Text(checkResult()),
//       ],
//     ));
//   }
// }

  checkResult() {
    if (phq7 == "เป็นบางวัน 1-7 วัน") {
      if (phq1 == "เป็นทุกวัน") {
        if (phq3 == "เป็นทุกวัน") {
          if (phq9 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq9 == "เป็นบ่อย > 7 วัน") {
            if (phq6 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq6 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq6 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          } else if (phq9 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
            if (phq5 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq5 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq5 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          }
        } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง"; //19
        } else if (phq3 == "เป็นบ่อย > 7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง"; //20
        } else if (phq3 == "ไม่มีเลย") {
          //21

          if (phq8 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq8 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //25
          }
        }
      } else if (phq1 == "เป็นบ่อย > 7 วัน") {
        if (phq9 == "เป็นทุกวัน") {
          if (phq8 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq8 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง"; //31
          }
        } else if (phq9 == "เป็นบ่อย > 7 วัน") {
          if (phq6 == "เป็นทุกวัน") {
            if (phq8 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq8 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq8 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง"; //37
            }
          } else if (phq6 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //38
          } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
            if (phq3 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //40
            } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
              if (phq2 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //42
              } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย"; //43
              } else if (phq2 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //44
              } else if (phq2 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อย"; //45
              }
            } else if (phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //46
            } else if (phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง"; //47
            }
          } else if (phq6 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย"; //48
          }
        } else if (phq9 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับน้อย"; //49
        } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
          if (phq4 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //51
          } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
            if (phq2 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //53
            } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
              if (phq5 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //55
              } else if (phq5 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //56
              } else if (phq5 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อย"; //57
              } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย"; //58
              }
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //59
            } else if (phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //60
            }
          } else if (phq4 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq4 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย"; //62
          }
        }
      } else if (phq1 == "ไม่มีเลย") {
        if (phq4 == "เป็นทุกวัน") {
          if (phq5 == "เป็นบ่อย > 7 วัน" && phq5 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq5 == "ไม่มีเลย" && phq5 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับน้อย"; //68
          }
        } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
          if (phq2 == "เป็นทุกวัน") {
            if (phq5 == "เป็นบ่อย > 7 วัน" &&
                phq5 == "เป็นทุกวัน" &&
                phq5 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //73
            } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //74
            }
          } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
            if (phq6 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อยมาก";
            } else if (phq6 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
                if (phq8 == "เป็นบ่อย > 7 วัน" &&
                    phq8 == "เป็นบางวัน 1-7 วัน" &&
                    phq8 == "เป็นทุกวัน") {
                  return "มีความเสี่ยงระดับน้อย";
                } else if (phq8 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก"; //83-84
                }
              } else if (phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq3 == "ไม่มีเลย") {
                if (phq5 == "เป็นบ่อย > 7 วัน" &&
                    phq5 == "เป็นทุกวัน" &&
                    phq5 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับน้อย"; //90
                }
              }
            } else if (phq6 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก"; //91
            }
          } else if (phq2 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับน้อย"; //92
          } else if (phq2 == "ไม่มีเลย") {
            if (phq5 == "เป็นบ่อย > 7 วัน" && phq5 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย"; //95
            } else if (phq5 == "ไม่มีเลย" && phq5 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับน้อยมาก"; //97
            }
          }
        } else if (phq4 == "เป็นบ่อย > 7 วัน") {
          if (phq5 == "เป็นบ่อย > 7 วัน") {
            if (phq6 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq6 == "เป็นบ่อย > 7 วัน") {
              if (phq3 == "เป็นทุกวัน" &&
                  phq3 == "เป็นบางวัน 1-7 วัน" &&
                  phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //104-105
              }
            } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับน้อย"; //106
            } else if (phq6 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //107
            }
          } else if (phq5 == "เป็นทุกวัน") {
            if (phq2 == "เป็นทุกวัน" &&
                phq2 == "เป็นบางวัน 1-7 วัน" &&
                phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //112
            }
          } else if (phq5 == "ไม่มีเลย") {
            if (phq3 == "เป็นทุกวัน" &&
                phq3 == "เป็นบางวัน 1-7 วัน" &&
                phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq3 == "ไม่มีเลย") {
              if (phq8 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq8 == "เป็นบางวัน 1-7 วัน" &&
                  phq8 == "ไม่มีเลย" &&
                  phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก"; //121
              }
            }
          } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับน้อย"; //122
          }
        } else if (phq4 == "ไม่มีเลย") {
          if (phq8 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
            if (phq6 == "เป็นทุกวัน" && phq6 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
              if (phq5 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq5 == "เป็นทุกวัน" && phq5 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
                if (phq9 == "เป็นทุกวัน" &&
                    phq9 == "ไม่มีเลย" &&
                    phq9 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq9 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย"; //135-136
                }
              }
            } else if (phq6 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย"; //137 สลับบน 127
            }
          } else if (phq8 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อยมาก";
          } else if (phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับน้อย"; //139
          }
        }
      } else if (phq1 == "เป็นบางวัน 1-7 วัน") {
        if (phq5 == "เป็นบ่อย > 7 วัน") {
          if (phq9 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq9 == "เป็นบ่อย > 7 วัน") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นทุกวัน" &&
                  phq3 == "เป็นบ่อย > 7 วัน" &&
                  phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย"; //149 - 148
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            }
          } else if (phq9 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq8 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq8 == "เป็นบางวัน 1-7 วัน" &&
                  phq8 == "ไม่มีเลย" &&
                  phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อย";
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //161
            }
          }
        } else if (phq5 == "เป็นทุกวัน") {
          if (phq6 == "เป็นทุกวัน") {
            if (phq8 == "เป็นบ่อย > 7 วัน" &&
                phq8 == "เป็นบางวัน 1-7 วัน" &&
                phq8 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq8 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง"; //167
            }
          } else if (phq6 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
            if (phq3 == "เป็นทุกวัน" && phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน" && phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //173
            }
          } else if (phq6 == "ไม่มีเลย") {
            if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq9 == "เป็นบ่อย > 7 วัน" && phq9 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            }
          }
        } else if (phq5 == "ไม่มีเลย") {
          if (phq8 == "เป็นบ่อย > 7 วัน") {
            if (phq2 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน" &&
                phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq2 == "ไม่มีเลย") {
              if (phq9 == "เป็นทุกวัน" &&
                  phq9 == "เป็นบ่อย > 7 วัน" &&
                  phq9 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย"; //188
              }
            }
          } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
            if (phq6 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อยมาก";
            } else if (phq6 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นทุกวัน" &&
                  phq3 == "เป็นบางวัน 1-7 วัน" &&
                  phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก"; //196
              }
            } else if (phq6 == "ไม่มีเลย") {
              if (phq3 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
                if (phq2 == "เป็นทุกวัน" &&
                    phq2 == "เป็นบางวัน 1-7 วัน" &&
                    phq2 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                } else if (phq2 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก"; //203
                }
              } else if (phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก"; //205
              }
            }
          } else if (phq8 == "ไม่มีเลย") {
            if (phq3 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
              if (phq6 == "เป็นทุกวัน" &&
                  phq6 == "เป็นบางวัน 1-7 วัน" &&
                  phq6 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq6 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย"; //211 - 212
              }
            } else if (phq3 == "เป็นบ่อย > 7 วัน") {
              if (phq4 == "เป็นทุกวัน" &&
                  phq4 == "เป็นบางวัน 1-7 วัน" &&
                  phq4 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq4 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              }
            } else if (phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            }
          } else if (phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //219
          }
        } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
          if (phq6 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq6 == "เป็นบ่อย > 7 วัน") {
            if (phq3 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq3 == "เป็นบ่อย > 7 วัน") {
              if (phq9 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq9 == "เป็นทุกวัน" &&
                  phq9 == "ไม่มีเลย" &&
                  phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย"; //229
              }
            } else if (phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //230
            }
          } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq2 == "เป็นทุกวัน" &&
                  phq2 == "เป็นบางวัน 1-7 วัน" &&
                  phq2 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq2 == "ไม่มีเลย") {
                if (phq9 == "เป็นทุกวัน" &&
                    phq9 == "เป็นบ่อย > 7 วัน" &&
                    phq9 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับน้อย"; //241
                }
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "ไม่มีเลย") {
              if (phq8 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
                if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย"; //247
                } else if (phq9 == "ไม่มีเลย") {
                  if (phq2 == "เป็นทุกวัน" &&
                      phq2 == "เป็นบางวัน 1-7 วัน" &&
                      phq2 == "ไม่มีเลย") {
                    return "มีความเสี่ยงระดับน้อยมาก";
                  } else if (phq2 == "เป็นบ่อย > 7 วัน") {
                    return "มีความเสี่ยงระดับน้อย";
                  }
                } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                }
              } else if (phq8 == "ไม่มีเลย" && phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก"; //255
              }
            }
          } else if (phq6 == "ไม่มีเลย") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq9 == "เป็นทุกวัน" && phq9 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq9 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
                if (phq3 == "เป็นทุกวัน" &&
                    phq3 == "เป็นบางวัน 1-7 วัน" &&
                    phq3 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                } else if (phq3 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                }
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "ไม่มีเลย") {
              if (phq8 == "เป็นบ่อย > 7 วัน") {
                if (phq9 == "เป็นทุกวัน" &&
                    phq9 == "เป็นบ่อย > 7 วัน" &&
                    phq9 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                } else if (phq9 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก"; //273
                }
              } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
                if (phq3 == "เป็นทุกวัน") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
                  if (phq9 == "เป็นทุกวัน" &&
                      phq9 == "เป็นบ่อย > 7 วัน" &&
                      phq9 == "เป็นบางวัน 1-7 วัน") {
                    return "มีความเสี่ยงระดับน้อย";
                  } else if (phq9 == "ไม่มีเลย") {
                    return "มีความเสี่ยงระดับน้อยมาก"; //280
                  }
                } else if (phq3 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                } else if (phq3 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                }
              } else if (phq8 == "ไม่มีเลย") {
                return "";
              } else if (phq8 == "ไม่มีเลย" && phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก"; //284
              }
            }
          }
        }
      }
    } else if (phq7 == "เป็นทุกวัน") {
      if (phq6 == "เป็นทุกวัน") {
        if (phq1 == "เป็นทุกวัน") {
          return "มีความเสี่ยงระดับรุนแรง";
        } else if (phq1 == "เป็นบ่อย > 7 วัน") {
          if (phq9 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq9 == "เป็นบ่อย > 7 วัน") {
            if (phq2 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq3 == "เป็นทุกวัน" &&
                  phq3 == "เป็นบางวัน 1-7 วัน" &&
                  phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับรุนแรง";
              }
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              if (phq5 == "เป็นบ่อย > 7 วัน" &&
                  phq5 == "เป็นทุกวัน" &&
                  phq5 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //301
              }
            } else if (phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับรุนแรง";
            }
          } else if (phq9 == "ไม่มีเลย" && phq9 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          }
        } else if (phq1 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับปานกลาง"; //305
        } else if (phq1 == "เป็นบางวัน 1-7 วัน") {
          if (phq4 == "เป็นทุกวัน" && phq4 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq4 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย"; //310
          }
        }
      } else if (phq6 == "เป็นบ่อย > 7 วัน") {
        if (phq1 == "เป็นทุกวัน") {
          if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq9 == "ไม่มีเลย" && phq9 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //316
          }
        } else if (phq1 == "เป็นบ่อย > 7 วัน") {
          if (phq4 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
            if (phq2 == "เป็นทุกวัน") {
              if (phq3 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq3 == "เป็นทุกวัน" &&
                  phq3 == "เป็นบ่อย > 7 วัน" &&
                  phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับรุนแรง";
              }
            } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              if (phq8 == "เป็นบ่อย > 7 วัน") {
                if (phq5 == "เป็นบ่อย > 7 วัน" &&
                    phq5 == "ไม่มีเลย" &&
                    phq5 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับปานกลาง";
                } else if (phq5 == "เป็นทุกวัน") {
                  return "มีความเสี่ยงระดับรุนแรง";
                }
              } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq8 == "ไม่มีเลย" && phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง"; //334
              }
            } else if (phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            }
          } else if (phq4 == "เป็นบ่อย > 7 วัน") {
            if (phq5 == "เป็นบ่อย > 7 วัน" &&
                phq5 == "เป็นทุกวัน" &&
                phq5 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
              if (phq8 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq8 == "เป็นบางวัน 1-7 วัน" &&
                  phq8 == "ไม่มีเลย" &&
                  phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง"; //344
              }
            }
          } else if (phq4 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง";
          }
        } else if (phq1 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq1 == "เป็นบางวัน 1-7 วัน") {
          if (phq5 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq5 == "เป็นทุกวัน") {
            if (phq9 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq9 == "เป็นบ่อย > 7 วัน") {
              if (phq4 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
                if (phq2 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับรุนแรง";
                } else if (phq2 == "เป็นทุกวัน" &&
                    phq2 == "เป็นบางวัน 1-7 วัน" &&
                    phq2 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับปานกลาง";
                }
              } else if (phq4 == "เป็นบ่อย > 7 วัน" && phq4 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับรุนแรง"; //359
              }
            } else if (phq9 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          } else if (phq5 == "ไม่มีเลย" && phq5 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //363
          }
        }
      } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
        if (phq3 == "เป็นทุกวัน") {
          if (phq2 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq1 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq1 == "เป็นบ่อย > 7 วัน" &&
                  phq1 == "ไม่มีเลย" &&
                  phq1 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //373
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน" && phq4 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          } else if (phq2 == "เป็นบ่อย > 7 วัน") {
            if (phq9 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq9 == "เป็นทุกวัน" &&
                phq9 == "ไม่มีเลย" &&
                phq9 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //380
            }
          } else if (phq2 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง";
          }
        } else if (phq3 == "เป็นบางวัน 1-7 วัน" && phq3 == "เป็นบ่อย > 7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq3 == "ไม่มีเลย") {
          if (phq2 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq2 == "เป็นทุกวัน" &&
              phq2 == "เป็นบางวัน 1-7 วัน" &&
              phq2 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย"; //388
          }
        }
      } else if (phq6 == "ไม่มีเลย") {
        if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบ่อย > 7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq9 == "ไม่มีเลย") {
          if (phq2 == "เป็นทุกวัน" && phq2 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq2 == "เป็นบางวัน 1-7 วัน" && phq2 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย"; //396
          }
        } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
          if (phq1 == "เป็นทุกวัน" && phq1 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq1 == "ไม่มีเลย" && phq1 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับน้อย"; //401
          }
        }
      }
    } else if (phq7 == "เป็นบ่อย > 7 วัน") {
      if (phq1 == "เป็นทุกวัน") {
        if (phq9 == "เป็นทุกวัน") {
          return "มีความเสี่ยงระดับรุนแรง";
        } else if (phq9 == "เป็นบ่อย > 7 วัน") {
          if (phq8 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
            if (phq3 == "เป็นทุกวัน") {
              if (phq6 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq6 == "เป็นทุกวัน" &&
                  phq6 == "เป็นบ่อย > 7 วัน" &&
                  phq6 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับรุนแรง"; //412
              }
            } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบ่อย > 7 วัน") {
              if (phq5 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq5 == "เป็นบ่อย > 7 วัน" &&
                  phq5 == "ไม่มีเลย" &&
                  phq5 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง"; //418
              }
            } else if (phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          } else if (phq8 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          }
        } else if (phq9 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
          if (phq2 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq2 == "เป็นบางวัน 1-7 วัน" &&
              phq2 == "เป็นบ่อย > 7 วัน" &&
              phq2 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง"; //427
          }
        }
      } else if (phq1 == "เป็นบ่อย > 7 วัน") {
        if (phq6 == "เป็นทุกวัน") {
          if (phq3 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับรุนแรง";
          } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
            if (phq8 == "เป็นบ่อย > 7 วัน") {
              if (phq9 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq9 == "เป็นบ่อย > 7 วัน" &&
                  phq9 == "ไม่มีเลย" &&
                  phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              }
            } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq8 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq8 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            }
          } else if (phq3 == "เป็นบ่อย > 7 วัน" && phq3 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับรุนแรง"; //441
          }
        } else if (phq6 == "เป็นบ่อย > 7 วัน") {
          if (phq9 == "เป็นทุกวัน") {
            if (phq2 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              if (phq4 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              } else if (phq4 == "เป็นบ่อย > 7 วัน") {
                if (phq5 == "เป็นบ่อย > 7 วัน" &&
                    phq5 == "เป็นทุกวัน" &&
                    phq5 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับรุนแรง";
                } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
                  return "มีความเสี่ยงระดับปานกลาง";
                }
              } else if (phq4 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับรุนแรง"; //454
              }
            } else if (phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับรุนแรง";
            }
          } else if (phq9 == "เป็นบ่อย > 7 วัน") {
            if (phq8 == "เป็นบ่อย > 7 วัน") {
              if (phq5 == "เป็นบ่อย > 7 วัน") {
                if (phq2 == "เป็นทุกวัน") {
                  return "มีความเสี่ยงระดับรุนแรง";
                } else if (phq2 == "เป็นบางวัน 1-7 วัน" &&
                    phq2 == "เป็นบ่อย > 7 วัน" &&
                    phq2 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับปานกลาง"; //462
                }
              } else if (phq5 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับรุนแรง";
              } else if (phq5 == "ไม่มีเลย" && phq5 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับปานกลาง";
              }
            } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq8 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq8 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับรุนแรง"; //468
            }
          } else if (phq9 == "ไม่มีเลย") {
            if (phq3 == "เป็นทุกวัน" && phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน" && phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย";
            }
          } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //474
          }
        } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq6 == "ไม่มีเลย") {
          if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq9 == "ไม่มีเลย" && phq9 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับน้อย"; //480
          }
        }
      } else if (phq1 == "ไม่มีเลย") {
        if (phq4 == "เป็นทุกวัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
          return "มีความเสี่ยงระดับน้อย";
        } else if (phq4 == "เป็นบ่อย > 7 วัน") {
          if (phq6 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq6 == "เป็นบ่อย > 7 วัน") {
            if (phq2 == "เป็นทุกวัน" &&
                phq2 == "เป็นบางวัน 1-7 วัน" &&
                phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //490
            }
          } else if (phq6 == "เป็นบางวัน 1-7 วัน" && phq6 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          }
        } else if (phq4 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับน้อย"; //493
        }
      } else if (phq1 == "เป็นบางวัน 1-7 วัน") {
        if (phq3 == "เป็นทุกวัน") {
          if (phq6 == "เป็นทุกวัน") {
            if (phq2 == "เป็นทุกวัน" && phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน" && phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          } else if (phq6 == "เป็นบ่อย > 7 วัน") {
            if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับรุนแรง";
            } else if (phq9 == "ไม่มีเลย" && phq9 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง"; //505
            }
          } else if (phq6 == "เป็นบางวัน 1-7 วัน" && phq6 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับปานกลาง";
          }
        } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
          if (phq9 == "เป็นทุกวัน" && phq9 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq9 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
            if (phq5 == "เป็นบ่อย > 7 วัน" &&
                phq5 == "เป็นทุกวัน" &&
                phq5 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับน้อย"; //516
            }
          }
        } else if (phq3 == "เป็นบ่อย > 7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq3 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับน้อย";
        }
      }
    } else if (phq7 == "ไม่มีเลย") {
      if (phq1 == "เป็นทุกวัน") {
        if (phq8 == "เป็นบ่อย > 7 วัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
          if (phq9 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq9 == "เป็นทุกวัน" &&
              phq9 == "เป็นบ่อย > 7 วัน" &&
              phq9 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับปานกลาง"; //526
          }
        } else if (phq8 == "ไม่มีเลย") {
          return "มีความเสี่ยงระดับน้อย";
        } else if (phq8 == "เป็นทุกวัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        }
      } else if (phq1 == "เป็นบ่อย > 7 วัน") {
        if (phq9 == "เป็นทุกวัน") {
          return "มีความเสี่ยงระดับปานกลาง";
        } else if (phq9 == "เป็นบ่อย > 7 วัน") {
          if (phq8 == "เป็นบ่อย > 7 วัน") {
            if (phq3 == "เป็นทุกวัน" && phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน" && phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //536
            }
          } else if (phq8 == "เป็นบางวัน 1-7 วัน" && phq8 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          }
        } else if (phq9 == "ไม่มีเลย") {
          if (phq5 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อยมาก";
          } else if (phq5 == "เป็นบ่อย > 7 วัน" &&
              phq5 == "เป็นทุกวัน" &&
              phq5 == "เป็นบางวัน 1-7 วัน") {
            return "มีความเสี่ยงระดับน้อย"; //544
          }
        } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
          return "มีความเสี่ยงระดับน้อย";
        }
      } else if (phq1 == "ไม่มีเลย") {
        if (phq8 == "เป็นบ่อย > 7 วัน") {
          if (phq2 == "เป็นทุกวัน" &&
              phq2 == "เป็นบางวัน 1-7 วัน" &&
              phq2 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq2 == "ไม่มีเลย") {
            if (phq3 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
              if (phq9 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq9 == "เป็นทุกวัน" &&
                  phq9 == "ไม่มีเลย" &&
                  phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อยมาก"; //557
              }
            } else if (phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            }
          }
        } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
          if (phq6 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq6 == "เป็นบ่อย > 7 วัน") {
            if (phq2 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นทุกวัน" &&
                  phq3 == "เป็นบางวัน 1-7 วัน" &&
                  phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก"; //568
              }
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq2 == "ไม่มีเลย") {
              if (phq4 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq4 == "เป็นทุกวัน" &&
                  phq4 == "เป็นบ่อย > 7 วัน" &&
                  phq4 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              }
            }
          } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
            if (phq5 == "เป็นบ่อย > 7 วัน" && phq5 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq5 == "ไม่มีเลย") {
              if (phq9 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq9 == "เป็นทุกวัน" &&
                  phq9 == "ไม่มีเลย" &&
                  phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อยมาก"; //582
              }
            } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
                if (phq9 == "เป็นทุกวัน" && phq9 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq9 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
                  if (phq4 == "เป็นทุกวัน") {
                    return "มีความเสี่ยงระดับน้อย";
                  } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
                    if (phq2 == "เป็นทุกวัน" &&
                        phq2 == "เป็นบางวัน 1-7 วัน" &&
                        phq2 == "เป็นบ่อย > 7 วัน") {
                      return "มีความเสี่ยงระดับน้อย";
                    } else if (phq2 == "ไม่มีเลย") {
                      return "มีความเสี่ยงระดับน้อยมาก"; //595
                    }
                  } else if (phq4 == "เป็นบ่อย > 7 วัน") {
                    return "มีความเสี่ยงระดับน้อย";
                  } else if (phq4 == "ไม่มีเลย") {
                    return "มีความเสี่ยงระดับน้อยมาก";
                  }
                }
              } else if (phq3 == "เป็นบ่อย > 7 วัน" && phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              }
            }
          } else if (phq6 == "ไม่มีเลย") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              return "มีความเสี่ยงระดับน้อยมาก";
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              if (phq9 == "เป็นทุกวัน" &&
                  phq9 == "เป็นบ่อย > 7 วัน" &&
                  phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq9 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก"; //608
              }
            } else if (phq4 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            }
          }
        } else if (phq8 == "ไม่มีเลย") {
          if (phq4 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
            if (phq2 == "เป็นทุกวัน" && phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน" && phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก"; //615
            }
          } else if (phq4 == "เป็นบ่อย > 7 วัน") {
            if (phq3 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน" && phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            } else if (phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            }
          } else if (phq4 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อยมาก";
          }
        } else if (phq8 == "เป็นทุกวัน") {
          if (phq9 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          } else if (phq9 == "เป็นบ่อย > 7 วัน") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน" &&
                phq4 == "เป็นบ่อย > 7 วัน" &&
                phq4 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อย"; //628
            }
          } else if (phq9 == "ไม่มีเลย") {
            if (phq2 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq2 == "เป็นบางวัน 1-7 วัน" && phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับปานกลาง";
            }
          } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
            if (phq2 == "เป็นทุกวัน" &&
                phq2 == "เป็นบางวัน 1-7 วัน" &&
                phq2 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับปานกลาง";
            } else if (phq2 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย"; //638
            }
          }
        }
      } else if (phq1 == "เป็นบางวัน 1-7 วัน") {
        if (phq5 == "เป็นบ่อย > 7 วัน") {
          return "มีความเสี่ยงระดับน้อย";
        } else if (phq5 == "เป็นทุกวัน") {
          if (phq8 == "เป็นบ่อย > 7 วัน" && phq8 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq8 == "เป็นบางวัน 1-7 วัน" && phq8 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับปานกลาง";
          }
        } else if (phq5 == "ไม่มีเลย") {
          if (phq9 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับน้อยมาก";
          } else if (phq9 == "เป็นบ่อย > 7 วัน") {
            if (phq3 == "เป็นทุกวัน" &&
                phq3 == "เป็นบางวัน 1-7 วัน" &&
                phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq3 == "ไม่มีเลย") {
              if (phq8 == "เป็นบ่อย > 7 วัน" && phq8 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq8 == "เป็นบางวัน 1-7 วัน" && phq8 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก"; //656
              }
            }
          } else if (phq9 == "ไม่มีเลย") {
            return "มีความเสี่ยงระดับน้อยมาก";
          } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
            if (phq3 == "เป็นทุกวัน" && phq3 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq3 == "เป็นบางวัน 1-7 วัน" && phq3 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก"; //662
            }
          }
        } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
          if (phq2 == "เป็นทุกวัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq9 == "เป็นทุกวัน" &&
                  phq9 == "เป็นบ่อย > 7 วัน" &&
                  phq9 == "เป็นบางวัน 1-7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq9 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "ไม่มีเลย") {
              if (phq9 == "เป็นทุกวัน" && phq9 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq9 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
                if (phq6 == "เป็นทุกวัน" &&
                    phq6 == "เป็นบางวัน 1-7 วัน" &&
                    phq6 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq6 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย"; //681
                }
              }
            }
          } else if (phq2 == "เป็นบ่อย > 7 วัน") {
            return "มีความเสี่ยงระดับน้อย";
          } else if (phq2 == "ไม่มีเลย") {
            if (phq4 == "เป็นทุกวัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
              if (phq3 == "เป็นทุกวัน") {
                return "มีความเสี่ยงระดับน้อยมาก";
              } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
                if (phq6 == "เป็นทุกวัน" &&
                    phq6 == "เป็นบางวัน 1-7 วัน" &&
                    phq6 == "ไม่มีเลย") {
                  return "มีความเสี่ยงระดับน้อยมาก";
                } else if (phq6 == "เป็นบ่อย > 7 วัน") {
                  return "มีความเสี่ยงระดับน้อย";
                }
              } else if (phq3 == "เป็นบ่อย > 7 วัน") {
                return "มีความเสี่ยงระดับน้อย";
              } else if (phq3 == "ไม่มีเลย") {
                return "มีความเสี่ยงระดับน้อยมาก";
              }
            } else if (phq4 == "เป็นบ่อย > 7 วัน") {
              return "มีความเสี่ยงระดับน้อย";
            } else if (phq4 == "ไม่มีเลย") {
              return "มีความเสี่ยงระดับน้อยมาก";
            }
          }
        }
      }
    }
    int num = 0;
    if (phq1 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq1 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq1 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq1 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq2 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq2 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq2 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq2 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq3 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq3 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq3 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq3 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq4 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq4 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq4 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq4 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq5 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq5 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq5 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq5 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq6 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq6 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq6 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq6 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq7 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq7 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq7 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq7 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq8 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq8 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq8 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq8 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (phq9 == "ไม่มีเลย") {
      num = num + 0;
    } else if (phq9 == "เป็นบางวัน 1-7 วัน") {
      num = num + 1;
    } else if (phq9 == "เป็นบ่อย > 7 วัน") {
      num = num + 2;
    } else if (phq9 == "เป็นทุกวัน") {
      num = num + 3;
    }

    if (num <= 7) {
      return "มีความเสี่ยงระดับน้อยมาก";
    } else if (num >= 7 && num <= 12) {
      return "มีความเสี่ยงระดับน้อย}";
    } else if (num >= 13 && num <= 18) {
      return "มีความเสี่ยงระดับปานกลาง";
    } else if (num >= 19) {
      return "มีความเสี่ยงระดับรุนแรง";
    }
  }
}
